ci4/app/Controllers/datawarga.php

SELECT *
FROM `warga`
---
    public function index()
    {
        $warga = $this->wargaModel->findAll();